/**
 * 1. 버스 요금 계산기
 * 유저에게 나이를 물어보고, 버스요금도 입력받아서 결과값 나타내기
 * 7살 이하이면 무료
 * 8~19살 이면 30%할인
 * 65살 이상이면 30%할인
 * 나머지 100%임
 * 
 * 2. 사용자에게 10000~99999 사이 숫자를 입력받고
 * 각 자리의 합 나타내기, 단 위의 수를 벗어나면 오류! 나타내기
 */
// const a = window.prompt('age ??');
// const b = window.prompt('버스 요금 ??');
// const c = a <= 7 ? '무료' : a < 19 ? b*0.7 : a < 65 ? b*0.7 : b;
// console.log(`버스 요금은 ${parseInt(c)} 임`);

const d = window.prompt('숫자 ???');
const e = d < 10000 ? '오류!' : d > 99999 ? '오류!' : d;
const f = e == '오류!' ? '오류!' 
        : ((e / 10000) % 10)
        + ((e / 1000) % 10)
        + ((e / 100) % 10)
        + ((e / 10) % 10)
        + (e% 10);

console.log((e / 10000) % 10);
console.log((e / 10000));
console.log((e / 1000)%10);
console.log(`합은 ??? ${f}`);
